docs/hurdle.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2017-12-15 Fri 12:11 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Hurdle model estimation</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Abhishek Sarkar">
<link href="site_libs/bootstrap-3.3.5/css/cosmo.min.css" rel="stylesheet" />
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Hurdle model estimation</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org0996a64">Introduction</a></li>
<li><a href="#org8676b15">Test case</a></li>
<li><a href="#org3de8c5e">ML sanity check</a></li>
<li><a href="#org6ed67d5">Voom component</a></li>
</ul>
</div>
</div>

<div id="outline-container-org0996a64" class="outline-2">
<h2 id="org0996a64">Introduction</h2>
<div class="outline-text-2" id="text-org0996a64">
<p>
The key idea of <code>voom</code> (<a href="http://genomebiology.com/2014/15/2/R29">Law et al 2014</a>) is that the distribution of \(Y =
  \log_2(\mathrm{CPM} + 1)\) is approximately Gaussian. For simplicity,
consider one gene in one cell.
</p>

<p>
\[ R = \mbox{number of reads} \]
</p>

<p>
Assuming \(R\) follows the NB2 negative binomial model (Hilbe 2012):
</p>

<p>
\[ E[R] = \lambda \]
\[ V[R] = \lambda + \phi \lambda^2 \]
</p>

<p>
By the definition of CPM:
</p>

<p>
\[ Y = \log_2(R) + \mathrm{const} \]
</p>

<p>
By first order Taylor expansion:
</p>

<p>
\[ E[Y] = \mu \approx \log_2 \lambda + \mathrm{const} \]
</p>

<p>
By the delta method:
</p>

<p>
\[ V[Y] = \sigma^2 \approx V[R] / \lambda^2 = 1/\lambda + \phi \]
</p>

<p>
The key idea of <code>mast</code> (<a href="https://dx.doi.org/10.1186/s13059-015-0844-5">Finak et al 2015</a>) is to model non-zero \(R\) using a
Gaussian distribution, and model zero \(R\) using logistic regression. The
key distinction between this approach and the <a href="zinb.html">zero-inflated
negative binomial model</a> is that zeroes are assumed to arise from only one
process.
</p>

<p>
This naturally suggests a Bayesian model which simultaneously calls mean and
variance QTLs based on the likelihood:
</p>

<p>
\[ Y \mid Y = 0 \sim \mathrm{Bernoulli}(1 - \mathrm{sigmoid}(AX\theta_m + \delta)) \]
</p>

<p>
\[ Y \mid Y > 0 \sim N(AX\theta_m + \delta, \exp(-AX\theta_m - \delta) +
  \exp(AX\theta_v) + \sigma^2) \]
</p>

<p>
where \(\delta\) is a known constant that depends on library size, \(A\) maps
from cells to individuals, and \(X\) is the genotype matrix.
</p>

<p>
The key issues are:
</p>

<ol class="org-ol">
<li><p>
<b>Is it possible to develop an individual-level model?</b> An alternative
model would be to estimate a variance for each individual, and then plug
into existing QTL mapping software. This approach is naturally suggested
by the <code>voom</code> approximation, but it is not obvious that the approach will
generalize to zero-inflated data.
</p>

<p>
Fitting the proposed model will require writing new software as opposed to
plugging into existing software. We previously built an efficient
algorithm and inference engine to build these kind of models (<a href="https://www.biorxiv.org/content/early/2017/02/10/107623">Park et al
2017</a>), but it has one major issue: it is computationally expensive to
perform statistical tests on the fitted models because the approximate
Bayesian inferences underestimate the uncertainty in the estimated values.
</p></li>

<li><p>
<b>Do we need to actually fit the dropout model?</b> <code>mast</code> conditions on the
observed \(Y = 0\), not on a latent \(Z = 0\), which means we could simply
do the same and ignore zeros.
</p>

<p>
If we did so, then mean/variance QTL effect size estimation will be less
robust for genes with high dropout. This might not be a problem depending
on the stringency of gene filtering.
</p></li>

<li><p>
<b>For a single gene, do we need to worry about mean QTLs in LD with
variance QTLs?</b> We previously <a href="https://github.com/YPARK/fqtl">built multivariate mean/variance QTL models</a>
which could account for LD, and could share information between the mean
and variance models.
</p>

<p>
The fundamental problem is that if we assume that the mean and dispersion
both have genetic components, then the mean is no longer independent of
the dispersion.
</p>

<p>
This actually could be derived without using the fact that both depend on
the same genotypes if we use second-order Taylor expansion:
</p>

<p>
\[ \mu \approx \log_2 \lambda + \frac{V[R]}{2 \lambda^2} \]
</p></li>

<li><p>
<b>Do we need to share parameters between genes?</b> <code>mast</code> assumes genes are
conditionally independent. But this is no longer true when nearby genes
can be driven by overlapping (or correlated) <i>cis</i>-genotypes.
</p>

<p>
We previously developed multiresponse QTL models which learned the target
genes of causal variants, allowing the true target gene to explain away
nearby correlated genes (<a href="https://www.biorxiv.org/content/early/2017/11/14/219428">Park et al 2017</a>).
</p></li>
</ol>
</div>
</div>
