analysis/hurdle.org
* Test case

  #+CALL: get-gene-info() :exports both

  #+RESULTS:
  :RESULTS:
  #+BEGIN_EXAMPLE
                    chr      start        end      name strand      source
    gene                                                                    
    ENSG00000000419  hs20   49551404   49575092      DPM1      -  H. sapiens
    ENSG00000000457   hs1  169818772  169863408     SCYL3      -  H. sapiens
    ENSG00000000460   hs1  169631245  169823221  C1orf112      +  H. sapiens
    ENSG00000000938   hs1   27938575   27961788       FGR      -  H. sapiens
    ENSG00000000971   hs1  196621008  196716634       CFH      +  H. sapiens
  #+END_EXAMPLE
  :END:

  #+BEGIN_SRC ipython
    gene_info.query('name == "ZSWIM7"')
  #+END_SRC

  #+RESULTS:
  :RESULTS:
  #+BEGIN_EXAMPLE
                    chr     start       end    name strand      source
    gene                                                                
    ENSG00000214941  hs17  15879874  15903031  ZSWIM7      -  H. sapiens
  #+END_EXAMPLE
  :END:

  #+BEGIN_SRC ipython
    with gzip.open('/project2/gilad/singlecell-qtl/bulk/genotypes.vcf.gz', 'rt') as f:
      header = next(f).split()
    vcf = tabix.open('/project2/gilad/singlecell-qtl/bulk/genotypes.vcf.gz')
  #+END_SRC

  #+RESULTS:
  :RESULTS:
  :END:

  #+BEGIN_SRC ipython
    def _extract_genotypes(row, vcf, header, window):
      if row['strand'] == '+':
        start = row['start'] - window
        end = row['start']
      else:
        start = row['end']
        end = row['end'] + window
      result = pd.DataFrame(list(vcf.query('chr{}'.format(row['chr'][2:]), start, end)), columns=header).iloc[:,9:].astype(np.float32)
      return result
  #+END_SRC

  #+RESULTS:
  :RESULTS:
  :END:

  #+BEGIN_SRC ipython
    genotypes = _extract_genotypes(gene_info.loc['ENSG00000214941'], vcf=vcf, header=header, window=int(1e6)).rename(columns=lambda x: 'NA{}'.format(x))[sorted(annotations_qc['chip_id'].unique())]
    genotypes = genotypes.T.transform(lambda x: x - x.mean()).fillna(0)
    genotypes.shape
  #+END_SRC

  #+RESULTS:
  :RESULTS:
  : (21, 2506)
  :END:

  #+BEGIN_SRC ipython
    data = {'onehot': onehot,
            'genotypes': genotypes.values,
            'counts': umi_qc.loc['ENSG00000214941'].values.astype(np.float32).reshape(-1, 1),
            'normalizers': -np.log(umi_qc.agg(np.sum)).values.reshape(-1, 1)}
  #+END_SRC

  #+RESULTS:
  :RESULTS:
  :END:

  #+BEGIN_SRC ipython
    with open('test_data.pkl', 'wb') as f:
      pickle.dump(data, f)
  #+END_SRC

  #+RESULTS:
  :RESULTS:
  :END:

* Edward sanity check                                              :noexport:

  #+CALL: reset()

  #+RESULTS:
  :RESULTS:
  :END:

  #+BEGIN_SRC ipython
    m, _ = data['onehot'].shape
    n, p = data['genotypes'].shape

    x = tf.placeholder(tf.float32, [n, p])
    a = tf.placeholder(tf.float32, [m, n])
    beta = ed.models.Normal(loc=tf.zeros([p, 1]), scale=tf.ones([1]))
    y = ed.models.Normal(loc=tf.matmul(a, tf.matmul(x, beta)), scale=1.)

    q_beta = ed.models.NormalWithSoftplusScale(loc=tf.Variable(tf.zeros([p, 1])), scale=tf.Variable(tf.ones([1])))

    inf = ed.ReparameterizationKLqp(
      latent_vars={beta: q_beta},
      data={y: np.random.normal(size=(m, 1)).astype(np.float32),
            x: data['genotypes'],
            a: data['onehot']})
  #+END_SRC

  #+RESULTS:
  :RESULTS:
  :END:

  #+BEGIN_SRC ipython 
    inf.run(optimizer=tf.train.GradientDescentOptimizer(learning_rate=1e-6))
  #+END_SRC

  #+RESULTS:
  :RESULTS:
  : 1000/1000 [100%] ██████████████████████████████ Elapsed: 1s | Loss: 11070.640
  :END:

* ML sanity check
  
  #+BEGIN_SRC ipython
    with open('test_data.pkl', 'rb') as f:
      data = pickle.load(f)

    data['log_cpm'] = np.log(data['counts'] + 1) + data['normalizers'] + 6 * np.log(10)
  #+END_SRC

  #+RESULTS:
  :RESULTS:
  :END:

  #+CALL: reset()

  #+RESULTS:
  :RESULTS:
  :END:

  #+BEGIN_SRC ipython
    with tf.Graph().as_default():
      m, n = data['onehot'].shape

      onehot = tf.placeholder(tf.float32, [m, n])
      genotypes = tf.placeholder(tf.float32, [n, 1])
      log_cpm = tf.placeholder(tf.float32, [m, 1])
      library_size = tf.placeholder(tf.float32, [m, 1])

      with tf.variable_scope('params', initializer=tf.zeros_initializer):
        mean_effect = tf.get_variable('mean', [1, 1])
        log_rate = tf.matmul(genotypes, mean_effect)
        cell_bias = library_size + 6 * tf.log(10.)
        mean = tf.matmul(onehot, log_rate) + cell_bias

        disp_effect = tf.get_variable('disp', [1, 1])
        disp = tf.matmul(genotypes, disp_effect)
        resid = tf.get_variable('resid', [1, 1])
        var = tf.exp(-mean) + tf.matmul(onehot, tf.exp(disp)) + tf.exp(resid)

      llik = .5 * tf.reduce_sum(-tf.log(var) - tf.log(tf.constant(2 * np.pi)) - tf.square(log_cpm - mean) / var) 

      opt = [mean_effect, disp_effect, tf.exp(resid)]

      train = tf.train.RMSPropOptimizer(learning_rate=1e-2).minimize(-llik)

      feed_dict = {genotypes: data['genotypes'][:,0:1],
                   onehot: data['onehot'],
                   library_size: data['normalizers'],
                   log_cpm: data['log_cpm']}

      with tf.Session() as sess:
        sess.run(tf.global_variables_initializer())
        curr_llik = float('-inf')
        for i in range(3000):
          _, update = sess.run([train, llik], feed_dict)
          if np.isclose(update, curr_llik):
            print('Converged after {} epochs'.format(i))
            break
          else:
            curr_llik = update
        estimates = sess.run(opt)
  #+END_SRC

  #+RESULTS:
  :RESULTS:
  :END:

  #+BEGIN_SRC ipython
    curr_llik
  #+END_SRC

  #+RESULTS:
  :RESULTS:
  : -3191.2041
  :END:

  #+BEGIN_SRC ipython
    pd.DataFrame(np.hstack(estimates), columns=['mean_effect', 'disp_effect', 'resid'])
  #+END_SRC

  #+RESULTS:
  :RESULTS:
  #+BEGIN_EXAMPLE
     mean_effect  disp_effect    resid
    0     0.413716    -1.031514  0.87242
  #+END_EXAMPLE
  :END:

