docs/hurdle.html

<div id="outline-container-org8676b15" class="outline-2">
<h2 id="org8676b15">Test case</h2>
<div class="outline-text-2" id="text-org8676b15">
<pre class="example">
                chr      start        end      name strand      source
gene                                                                    
ENSG00000000419  hs20   49551404   49575092      DPM1      -  H. sapiens
ENSG00000000457   hs1  169818772  169863408     SCYL3      -  H. sapiens
ENSG00000000460   hs1  169631245  169823221  C1orf112      +  H. sapiens
ENSG00000000938   hs1   27938575   27961788       FGR      -  H. sapiens
ENSG00000000971   hs1  196621008  196716634       CFH      +  H. sapiens
</pre>

<div class="org-src-container">
<pre class="src src-ipython">gene_info.query(<span class="org-string">'name == "ZSWIM7"'</span>)
</pre>
</div>

<pre class="example">
                chr     start       end    name strand      source
gene                                                                
ENSG00000214941  hs17  15879874  15903031  ZSWIM7      -  H. sapiens
</pre>

<div class="org-src-container">
<pre class="src src-ipython"><span class="org-keyword">with</span> gzip.<span class="org-builtin">open</span>(<span class="org-string">'/project2/gilad/singlecell-qtl/bulk/genotypes.vcf.gz'</span>, <span class="org-string">'rt'</span>) <span class="org-keyword">as</span> f:
  <span class="org-variable-name">header</span> = <span class="org-builtin">next</span>(f).split()
<span class="org-variable-name">vcf</span> = tabix.<span class="org-builtin">open</span>(<span class="org-string">'/project2/gilad/singlecell-qtl/bulk/genotypes.vcf.gz'</span>)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-ipython"><span class="org-keyword">def</span> <span class="org-function-name">_extract_genotypes</span>(row, vcf, header, window):
  <span class="org-keyword">if</span> row[<span class="org-string">'strand'</span>] == <span class="org-string">'+'</span>:
    <span class="org-variable-name">start</span> = row[<span class="org-string">'start'</span>] - window
    <span class="org-variable-name">end</span> = row[<span class="org-string">'start'</span>]
  <span class="org-keyword">else</span>:
    <span class="org-variable-name">start</span> = row[<span class="org-string">'end'</span>]
    <span class="org-variable-name">end</span> = row[<span class="org-string">'end'</span>] + window
  <span class="org-variable-name">result</span> = pd.DataFrame(<span class="org-builtin">list</span>(vcf.query(<span class="org-string">'chr{}'</span>.<span class="org-builtin">format</span>(row[<span class="org-string">'chr'</span>][2:]), start, end)), columns=header).iloc[:,9:].astype(np.float32)
  <span class="org-keyword">return</span> result
</pre>
</div>

<div class="org-src-container">
<pre class="src src-ipython"><span class="org-variable-name">genotypes</span> = _extract_genotypes(gene_info.loc[<span class="org-string">'ENSG00000214941'</span>], vcf=vcf, header=header, window=<span class="org-builtin">int</span>(1e6)).rename(columns=<span class="org-keyword">lambda</span> x: <span class="org-string">'NA{}'</span>.<span class="org-builtin">format</span>(x))[<span class="org-builtin">sorted</span>(annotations_qc[<span class="org-string">'chip_id'</span>].unique())]
<span class="org-variable-name">genotypes</span> = genotypes.T.transform(<span class="org-keyword">lambda</span> x: x - x.mean()).fillna(0)
genotypes.shape
</pre>
</div>

<pre class="example">
(21, 2506)

</pre>

<div class="org-src-container">
<pre class="src src-ipython"><span class="org-variable-name">data</span> = {<span class="org-string">'onehot'</span>: onehot,
        <span class="org-string">'genotypes'</span>: genotypes.values,
        <span class="org-string">'counts'</span>: umi_qc.loc[<span class="org-string">'ENSG00000214941'</span>].values.astype(np.float32).reshape(-1, 1),
        <span class="org-string">'normalizers'</span>: -np.log(umi_qc.agg(np.<span class="org-builtin">sum</span>)).values.reshape(-1, 1)}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-ipython"><span class="org-keyword">with</span> <span class="org-builtin">open</span>(<span class="org-string">'test_data.pkl'</span>, <span class="org-string">'wb'</span>) <span class="org-keyword">as</span> f:
  pickle.dump(data, f)
</pre>
</div>
</div>
</div>

<div id="outline-container-org3de8c5e" class="outline-2">
<h2 id="org3de8c5e">ML sanity check</h2>
<div class="outline-text-2" id="text-org3de8c5e">
<div class="org-src-container">
<pre class="src src-ipython"><span class="org-keyword">with</span> <span class="org-builtin">open</span>(<span class="org-string">'test_data.pkl'</span>, <span class="org-string">'rb'</span>) <span class="org-keyword">as</span> f:
  <span class="org-variable-name">data</span> = pickle.load(f)

<span class="org-variable-name">data</span>[<span class="org-string">'log_cpm'</span>] = np.log(data[<span class="org-string">'counts'</span>] + 1) + data[<span class="org-string">'normalizers'</span>] + 6 * np.log(10)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-ipython"><span class="org-keyword">with</span> tf.Graph().as_default():
  <span class="org-variable-name">m</span>, <span class="org-variable-name">n</span> = data[<span class="org-string">'onehot'</span>].shape

  <span class="org-variable-name">onehot</span> = tf.placeholder(tf.float32, [m, n])
  <span class="org-variable-name">genotypes</span> = tf.placeholder(tf.float32, [n, 1])
  <span class="org-variable-name">log_cpm</span> = tf.placeholder(tf.float32, [m, 1])
  <span class="org-variable-name">library_size</span> = tf.placeholder(tf.float32, [m, 1])

  <span class="org-keyword">with</span> tf.variable_scope(<span class="org-string">'params'</span>, initializer=tf.zeros_initializer):
    <span class="org-variable-name">mean_effect</span> = tf.get_variable(<span class="org-string">'mean'</span>, [1, 1])
    <span class="org-variable-name">log_rate</span> = tf.matmul(genotypes, mean_effect)
    <span class="org-variable-name">cell_bias</span> = library_size + 6 * tf.log(10.)
    <span class="org-variable-name">mean</span> = tf.matmul(onehot, log_rate) + cell_bias

    <span class="org-variable-name">disp_effect</span> = tf.get_variable(<span class="org-string">'disp'</span>, [1, 1])
    <span class="org-variable-name">disp</span> = tf.matmul(genotypes, disp_effect)
    <span class="org-variable-name">resid</span> = tf.get_variable(<span class="org-string">'resid'</span>, [1, 1])
    <span class="org-variable-name">var</span> = tf.exp(-mean) + tf.matmul(onehot, tf.exp(disp)) + tf.exp(resid)

  <span class="org-variable-name">llik</span> = .5 * tf.reduce_sum(-tf.log(var) - tf.log(tf.constant(2 * np.pi)) - tf.square(log_cpm - mean) / var) 

  <span class="org-variable-name">opt</span> = [mean_effect, disp_effect, tf.exp(resid)]

  <span class="org-variable-name">train</span> = tf.train.RMSPropOptimizer(learning_rate=1e-2).minimize(-llik)

  <span class="org-variable-name">feed_dict</span> = {genotypes: data[<span class="org-string">'genotypes'</span>][:,0:1],
               onehot: data[<span class="org-string">'onehot'</span>],
               library_size: data[<span class="org-string">'normalizers'</span>],
               log_cpm: data[<span class="org-string">'log_cpm'</span>]}

  <span class="org-keyword">with</span> tf.Session() <span class="org-keyword">as</span> sess:
    sess.run(tf.global_variables_initializer())
    <span class="org-variable-name">curr_llik</span> = <span class="org-builtin">float</span>(<span class="org-string">'-inf'</span>)
    <span class="org-keyword">for</span> i <span class="org-keyword">in</span> <span class="org-builtin">range</span>(3000):
      <span class="org-variable-name">_</span>, <span class="org-variable-name">update</span> = sess.run([train, llik], feed_dict)
      <span class="org-keyword">if</span> np.isclose(update, curr_llik):
        <span class="org-keyword">print</span>(<span class="org-string">'Converged after {} epochs'</span>.<span class="org-builtin">format</span>(i))
        <span class="org-keyword">break</span>
      <span class="org-keyword">else</span>:
        <span class="org-variable-name">curr_llik</span> = update
    <span class="org-variable-name">estimates</span> = sess.run(opt)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-ipython">curr_llik
</pre>
</div>

<pre class="example">
-3191.2041

</pre>

<div class="org-src-container">
<pre class="src src-ipython">pd.DataFrame(np.hstack(estimates), columns=[<span class="org-string">'mean_effect'</span>, <span class="org-string">'disp_effect'</span>, <span class="org-string">'resid'</span>])
</pre>
</div>

<pre class="example">
 mean_effect  disp_effect    resid
0     0.413716    -1.031514  0.87242
</pre>
</div>
</div>
