analysis/hurdle.org
* Voom component

  #+CALL: reset()

  #+RESULTS:
  :RESULTS:
  :END:

  #+BEGIN_SRC ipython
    with open('test_data.pkl', 'rb') as f:
      data = pickle.load(f)

    data['log_cpm'] = np.log(data['counts'] + 1) + data['normalizers'] + 6 * np.log(10)
  #+END_SRC

  #+RESULTS:
  :RESULTS:
  :END:

  #+BEGIN_SRC ipython
    m, n = data['onehot'].shape
    _, p = data['genotypes'].shape

    onehot = tf.placeholder(tf.float32, [m, n])
    genotypes = tf.placeholder(tf.float32, [n, 1])
    library_size = tf.placeholder(tf.float32, [m, 1])

    ind_bias = ed.models.Normal(loc=tf.zeros([n, 1]), scale=tf.Variable(tf.ones([n, 1])))
    cell_bias = library_size + 6 * tf.log(10.)
    rate_effect = ed.models.Normal(loc=tf.zeros([1, 1]), scale=tf.ones([1, 1]))
    log_rate = tf.matmul(onehot, tf.matmul(genotypes, rate_effect) + ind_bias)
    mean = log_rate + cell_bias

    disp_effect = ed.models.Normal(loc=tf.zeros([1, 1]), scale=tf.ones([1, 1]))
    disp = tf.matmul(onehot, tf.matmul(genotypes, disp_effect))
    var = tf.exp(-log_rate) + tf.exp(disp) + tf.exp(tf.Variable(tf.zeros([1])))

    log_cpm = ed.models.Normal(loc=mean, scale=tf.sqrt(var))

    q_ind_bias = ed.models.Normal(loc=tf.Variable(tf.zeros([n, 1])), scale=tf.Variable(tf.ones([n, 1])))
    q_rate_effect = ed.models.Normal(loc=tf.Variable(tf.random_normal([1, 1])), scale=tf.Variable(tf.random_normal([1, 1])))
    q_disp_effect = ed.models.Normal(loc=tf.Variable(tf.zeros([1, 1])), scale=tf.Variable(tf.ones([1, 1])))

    inf = ed.ReparameterizationKLKLqp(
      latent_vars={
        rate_effect: q_rate_effect,
        ind_bias: q_ind_bias,
        disp_effect: q_disp_effect,
      },
      data={
        onehot: data['onehot'],
        genotypes: data['genotypes'][:,0:1],
        library_size: -data['normalizers'],
        log_cpm: data['log_cpm'],
      })
  #+END_SRC

  #+RESULTS:
  :RESULTS:
  :END:

  #+BEGIN_SRC ipython
    inf.run(n_samples=10, optimizer=tf.train.AdamOptimizer(learning_rate=5e-2))
  #+END_SRC

  #+RESULTS:
  :RESULTS:
  :END:

  #+BEGIN_SRC ipython
    res = pd.DataFrame(
      np.hstack(ed.get_session().run([q_rate_effect.mean(), q_rate_effect.variance(), q_disp_effect.mean(), q_disp_effect.variance()])),
      columns=['rate_effect_mean', 'rate_effect_var', 'disp_effect_mean', 'disp_effect_var'])
  #+END_SRC

  #+RESULTS:
  :RESULTS:
  :END:

  #+BEGIN_SRC ipython
    res
  #+END_SRC

  #+RESULTS:
  :RESULTS:
  #+BEGIN_EXAMPLE
     rate_effect_mean  rate_effect_var  disp_effect_mean  disp_effect_var
    0         -0.373444         0.003591         -2.677538         6.434384
  #+END_EXAMPLE
  :END:
